W5D3 Project/RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "wettt"], ["url", "erwewrew"], ["content", "ewrewr"], ["user_id", 1], ["created_at", "2017-10-31 20:54:52.991975"], ["updated_at", "2017-10-31 20:54:52.991975"]]