W4D5 Project/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sample title"], ["year", 1898], ["band_id", 1], ["created_at", "2017-10-27 23:36:09.692526"], ["updated_at", "2017-10-27 23:36:09.692526"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save