W5D3 Project/RedditClone/app/views/posts/show.html.erb

<ul>
  <% @post.subs.each do |s| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 4]]