w7d3/jbuilder/app/views/api/parties/index.json.jbuilder

SELECT "guests"."name" FROM "guests" INNER JOIN "invitations" ON "guests"."id" = "invitations"."guest_id" WHERE "invitations"."party_id" = $1  [["party_id", 1]]
---
  json.location party.location
  json.guests party.guests.pluck(:name)