W5D1 Project/epic_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.cheer_count = 0
    if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest", "cheer_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"